{
    "data": [
    {
            "company": "MyFoodLink",
            "image": "img/company/myfoodlink-logo.png",
            "sigla": "MFL",
            "position": "Software Developer",
            "startDate": "01/12/2021",
            "endDate": "",
            "description": "MyFoodLink is an eCommerce application and fully hosted specialist platform for grocery and liquor shops in Australia and New Zealand. We provide a comprehensive solution for supermarkets and bottle shops, catering to the specific needs of the industry. As a full-stack software developer, I develop and maintain the back-end for the Shop and MyFoodLink APIs, specializing in Ruby on Rails, MongoDB, PostgreSQL, WebAPIs, and Webhooks. I also lead the development of the cross-platform Shop app using Dart and Flutter for Android and iOS. With expertise in web and mobile application development and various integration methods, I ensure the eCommerce platform and mobile app deliver high-quality solutions for grocery and liquor shops. Utilizing DevOps methodologies, I spearheaded the development of a streamlined CI/CD pipeline through GitHub Actions. This automated deployment system efficiently handles over 50 distinct iOS and Android applications within a remarkable time frame of less than 3 hours, requiring only two to three simple clicks. Implementing this solution has effectively eliminated the need to assign two to three resources for a duration of 1 Month, saving over 360 hours of work.",
            "contact": [{
                "type": "site",
                "nome": "site",
                "class": "fa fa-link",
                "value": "http://www.myfoodlink.com"
            },
            {
                "type": "rede-social",
                "nome": "Facebook",
                "class": "fa fa-facebook",
                "value": "https://www.facebook.com/myfoodlink/"
            },
            {
                "type": "rede-social",
                "nome": "Linkedin",
                "class": "fa fa-linkedin",
                "value": "https://www.linkedin.com/company/myfoodlink/"
            }]
        },
        {
            "company": "Syntagium",
            "image": "img/company/syntagium-200x60.png",
            "sigla": "Syntagium",
            "position": "Software Developer (full-stack)",
            "startDate": "23/10/2021",
            "endDate": "17/12/2021",
            "description": "Syntagium specializes in software development and consulting services. They work on projects like the ProClain System, delivering innovative solutions within agreed timeframes. Their expertise lies in utilizing technologies like ASP .Net Zero, C#, and MVC architecture. As a full-stack software developer, I assisted in completing the delivery of the ProClain System within the agreed timeframe. I utilized ASP .Net Zero, C#, .NET Core 3.1, and MVC architecture to model the system. My role involved developing back-end solutions with C# .Net, ASP.Net MVC, and WebAPI, and front-end solutions with Razor, JavaScript, HTML5, and CSS. With experience in Agile development methodologies, I ensured the ProClain System met client and market needs by providing support and troubleshooting.",
            "contact": [{
                "type": "site",
                "nome": "site",
                "class": "fa fa-link",
                "value": "https://syntagium.com.au/"
            },
            {
                "type": "rede-social",
                "nome": "Linkedin",
                "class": "fa fa-linkedin",
                "value": "https://www.linkedin.com/company/syntagium-consulting/"
            }]
        },
        {
            "company": "Staffing",
            "image": "img/company/staffing-200x60.png",
            "sigla": "Staffing",
            "position": "Software Developer (full-stack)",
            "startDate": "05/04/2021",
            "endDate": "27/06/2021",
            "description": "Staffing is an organization that focuses on HR management and recruitment. They develop systems to assist organizations in identifying and hiring the best candidates available. Their solutions are designed to streamline and optimize HR processes. As a full-stack software developer, I developed and maintained HR management and candidate analysis/recruitment systems. I utilized .NET C#, ASP.Net MVC, WebAPI for back-end development, and AngularJS, Angular, JavaScript, HTML5, and CSS for front-end development. I managed the software development life cycle from requirements gathering to implementation, testing, and maintenance. Collaborating with teams, I effectively communicated technical details and provided support and troubleshooting. Ensuring the developed systems met client and market needs for HR management and recruitment was a key responsibility.",
            "contact": [{
                "type": "site",
                "nome": "site",
                "class": "fa fa-link",
                "value": "https://www.staffing.com.au/"
            },
            {
                "type": "rede-social",
                "nome": "Twitter",
                "class": "fa fa-twitter",
                "value": "https://twitter.com/staffingau"
            },
            {
                "type": "rede-social",
                "nome": "Linkedin",
                "class": "fa fa-linkedin",
                "value": "https://www.linkedin.com/company/staffing.com.au/mycompany/"
            }]
        },
        {
            "company": "AXXIOM",
            "image": "img/company/axxiom-200x128.jpg",
            "sigla": "AXXIOM",
            "position": "Development Analyst",
            "startDate": "10/12/2020",
            "endDate": "23/04/2021",
            "description": "AXXIOM is a technology company that conducts research, analysis, testing, and development projects for the electricity distribution system sector in Brazil. They specialize in creating high-quality and compliant systems that improve the performance, efficiency, and safety of electricity distribution. As a development analyst at AXXIOM, I played a key role in research, analysis, testing, and development projects for the electricity distribution system sector. I led a team in gathering and analyzing data and requirements, ensuring compliance with regulations and standards. My work significantly improved system performance, efficiency, and safety. I also created technical documentation and user manuals. Mentoring junior team members, collaborating with clients/stakeholders, and delivering high-quality systems were important aspects of my role. I developed solutions aligned with the specific needs of the electricity distribution sector in Brazil.",
            "contact": [{
                "type": "site",
                "nome": "site",
                "class": "fa fa-link",
                "value": "http://www.axxiom.com.br"
            },
            {
                "type": "rede-social",
                "nome": "Facebook",
                "class": "fa fa-facebook",
                "value": "https://www.facebook.com/AxxiomTecnologiaeInovacao/"
            },
            {
                "type": "rede-social",
                "nome": "Linkedin",
                "class": "fa fa-linkedin",
                "value": "https://www.linkedin.com/company/axxiom/"
            }]
        },
        {
            "company": "AXXIOM",
            "image": "img/company/axxiom-200x128.jpg",
            "sigla": "AXXIOM",
            "position": "Development Analyst",
            "startDate": "08/04/2014",
            "endDate": "11/12/2016",
            "description": "As a software development analyst and Local Configuration Manager at AXXIOM, I played a pivotal role within the R&D team, responsible for conducting research, analysis, testing, and development projects specifically tailored for the electricity distribution system sector in Brazil. Collaborating closely with a team of skilled engineers and developers, I actively contributed to the gathering and meticulous analysis of data and requirements for new projects. Leveraging my expertise in Java, C#, Angular, MS SQL, and other technologies, I developed cutting-edge software solutions that significantly enhanced the performance, efficiency, and safety of electricity distribution systems. Throughout the development lifecycle, I adhered to the highest coding standards and best practices, ensuring the robustness and maintainability of the systems. In addition to my development responsibilities, I served as the Local Configuration Manager, overseeing the configuration management process and ensuring proper version control and release management. I utilized tools like Jenkins and SonarQube for continuous integration and code quality analysis, enabling seamless integration and delivering high-quality software solutions. My profound knowledge of the regulations and standards governing the electricity distribution sector in Brazil facilitated the development of compliant systems that met industry requirements. Moreover, I took charge of creating and maintaining comprehensive technical documentation, including software design documents, test plans, and user manuals. By providing consistent technical support and troubleshooting assistance, I ensured the seamless operation of the systems in use.",
            "contact": [{
                "type": "site",
                "nome": "site",
                "class": "fa fa-link",
                "value": "http://www.axxiom.com.br"
            },
            {
                "type": "rede-social",
                "nome": "Facebook",
                "class": "fa fa-facebook",
                "value": "https://www.facebook.com/AxxiomTecnologiaeInovacao/"
            },
            {
                "type": "rede-social",
                "nome": "Linkedin",
                "class": "fa fa-linkedin",
                "value": "https://www.linkedin.com/company/axxiom/"
            }]
        },
        {
            "company": "Flag",
            "image": "img/company/flagintelliwan-200x128.jpg",
            "sigla": "Flag",
            "position": "Software Developer",
            "startDate": "03/04/2013",
            "endDate": "28/03/2014",
            "description": "Flag is dedicated to the development and maintenance of a specialized medical system for children's cranial care. Their software solutions support medical professionals in diagnosing and treatingcranial conditions in children, ensuring efficient and effective care. As a software developer at Flag, I developed and maintained a specialized medical system for children's cranial care. I utilized C#, JavaScript, and SQL to create Windows Forms, WebForms, and ASP.NET MVC applications. Collaborating with medical professionals, I actively worked to understand requirements and improve the diagnosis and treatment process. I also ensured system quality through rigorous testing, maintenance, and updates to meet evolving needs in the medical field.",
            "contact": [{
                "type": "site",
                "nome": "site",
                "class": "fa fa-link",
                "value": "http://site.flag.com.br/"
            },
            {
                "type": "rede-social",
                "nome": "Facebook",
                "class": "fa fa-facebook",
                "value": "https://www.facebook.com/pages/Flag-Intelliwan/147835338717088"
            },
            {
                "type": "rede-social",
                "nome": "Linkedin",
                "class": "fa fa-linkedin",
                "value": "https://www.linkedin.com/company/flag-intelliwan/about/"
            }]
        },
        {
            "company": "TSA Engenharia",
            "image": "img/company/tsa-200×128.jpg",
            "sigla": "TSA",
            "position": "Development Analyst trainee",
            "startDate": "18/10/2012",
            "endDate": "28/03/2013",
            "description": "TSA Engenharia is a company focused on technology and systems automation for various industries. They develop solutions on the Microsoft platform, utilizing .NET technology, to optimize and automate business processes. As a development analyst trainee at TSA Engenharia, I developed systems and automated business processes on the Microsoft platform using .NET technology. I utilized C#, JavaScript, SQL, and various technologies such as Windows Forms, ASP.NET MVC, and NHibernate. My responsibilities included designing and implementing solutions that supported the organization's operations and processes. Throughout the software development life cycle, from requirements gathering to implementation, testing, and maintenance, I ensured effective teamwork and clear communication of technical details.",
            "contact": [{
                "type": "site",
                "nome": "site",
                "class": "fa fa-link",
                "value": "https://www.tsaengenharia.com.br/"
            },
            {
                "type": "rede-social",
                "nome": "Facebook",
                "class": "fa fa-facebook",
                "value": "https://www.facebook.com/tsatecnologiaautomacao"
            },
            {
                "type": "rede-social",
                "nome": "Linkedin",
                "class": "fa fa-linkedin",
                "value": "https://www.linkedin.com/company/tsa---tecnologia-de-sistemas-de-automa-o-s-a/"
            }]
        },
        {
            "company": "Techbiz",
            "image": "img/company/Techbiz-200x128.jpg",
            "sigla": "tbiz",
            "position": "Software Development Intern",
            "startDate": "24/10/2011",
            "endDate": "15/10/2012",
            "description": "Techbiz specializes in software development for various sectors, including systems for airport control. They focus on creating and maintaining efficient solutions that support the operations of airports and ensure smooth management. As a software development intern at Techbiz, I analyzed and developed Infraero customer systems, with a focus on airport control. I utilized .NET 4.0, ASP.NET MVC, Entity Framework, and JQuery technologies in the development process. I actively collaborated in design, documentation, testing, and maintenance processes. Additionally, I executed test cases and ensured system quality through black-box testing. I also contributed to the software approval and task approval processes.",
            "contact": [{
                "type": "site",
                "nome": "site",
                "class": "fa fa-link",
                "value": "http://www.techbiz.com.br/"
            },
            {
                "type": "rede-social",
                "nome": "Facebook",
                "class": "fa fa-facebook",
                "value": "https://www.facebook.com/TechBiz-Informática-346094915407508/"
            },
            {
                "type": "rede-social",
                "nome": "Linkedin",
                "class": "fa fa-linkedin",
                "value": "https://www.linkedin.com/company/techbizbrasil/"
            }]
        },
        {
            "company": "Direcional Engenharia",
            "image": "img/company/Direcional-200x128.jpg",
            "sigla": "direcional",
            "position": "Software Development Intern",
            "startDate": "11/08/2010",
            "endDate": "10/08/2011",
            "description": "Direcional Engenharia is a civil engineering company. As a software development intern, I contributed to the development and analysis of internal systems that supported the company's operations and processes. I utilized C#, .NET technology, and custom software applications to automate tasks and improve data management. Testing, troubleshooting, and maintaining systems were key aspects of my role to ensure reliability and meet specific requirements.",
            "contact": [{
                "type": "site",
                "nome": "site",
                "class": "fa fa-link",
                "value": "https://direcional.com.br/"
            },
            {
                "type": "rede-social",
                "nome": "Facebook",
                "class": "fa fa-facebook",
                "value": "https://www.facebook.com/direcionalengenharia/"
            },
            {
                "type": "rede-social",
                "nome": "Linkedin",
                "class": "fa fa-linkedin",
                "value": "https://www.linkedin.com/company/direcional-engenharia/"
            }]
        },
        {
            "company": "Newton",
            "image": "img/company/NewtonPaiva-200x128.jpg",
            "sigla": "Newton",
            "position": "Computing instructor",
            "startDate": "05/10/2013",
            "endDate": "05/10/2013",
            "description": "Newton is an educational institution, and as a computing instructor, I participated in their '3rd NEWTON PAIVA SOCIAL ACTION' event, where I provided instruction on basic computer skills to promote digital inclusion among the elderly.",
            "contact": [{
                "type": "site",
                "nome": "site",
                "class": "fa fa-link",
                "value": "http://www.newtonpaiva.br/"
            },
            {
                "type": "rede-social",
                "nome": "Facebook",
                "class": "fa fa-facebook",
                "value": "https://www.facebook.com/centrouniversitarionewtonpaiva"
            },
            {
                "type": "rede-social",
                "nome": "Linkedin",
                "class": "fa fa-linkedin",
                "value": "https://www.linkedin.com/school/newtonpaiva/"
            }]					
        }
    ]
}